{
    "Aries":"The stars conspire to bring forth a healthy ego boost, dear Aries, thanks to a sweet exchange between the Leo moon and Chiron. Lean into these warm vibes by being authentically yourself, even if doing so causes a few heads to turn. Watch out for stubborn and rebellious behavior when Luna and Uranus square off, bringing childish energy to the collective. You'll feel elevated and capable of steering away from drama when the Nodes of Fate activate this evening, pushing you toward positive relationships and creative outlets. Consider getting to bed at an early hour before Venus and Saturn face off just before midnight.",
    "Taurus":"Find a warm and happy memory to hold onto this morning, dear Taurus, as the Leo moon glows a kiss to Chiron. These vibes are perfect for self-soothing and supporting yourself emotionally, so be sure to nurture yourself from a place of unconditional love. Unfortunately, the vibe may feel rockier when Luna and Uranus square off this afternoon, opening the door for emotional upheaval and mood swings. Watch out for triggers, stepping away from dramatic situations before they have a chance to ruin your day. Embrace solitude this evening when the Nodes of Fate activate, hiding away in the comfort of your home.",
    "Gemini":"The Leo moon blows a kiss to Chiron this morning, dear Gemini, putting you in the mood to connect. Send love to friends far and wide, finding elation through community as you navigate this cosmic climate. Remember your filter as afternoon settles in and Luna squares off with Uranus, as it would be easy to overshare or shock your counterpart. Invest in new friendships this evening when the Nodes of Fate activate, reaching out to any acquaintances you've developed a fondness for. However, it may be best to lay low as the day comes to a close and Venus faces off with Saturn.",
    "Cancer":"The Leo moon blows a kiss to Chiron this morning, dear Cancer, granting permission to treat yourself to something special, reaping the rewards of your hard work while honoring what you've built. Just be sure to curb your spending as afternoon settles in and Luna squares off with Uranus, stepping away from your favorite shops and online boutiques. Embrace leisure and relaxation from the comfort of home when the Nodes of Fate activate this evening, filling your space with a comforting and warm ambiance. Consider meditating before crawling under the covers later tonight before Venus and Saturn face off, letting down psychic guards while calling in peace and spiritual support.",
    "Leo":"The Leo moon blows a kiss to Chiron this morning, dearest Leo, acting as a reminder that you are a spiritual being having a human experience. Allow yourself to fully appreciate the uniqueness of your existence, taking a moment to marvel at the mysterious nature of our universe. Watch out for plot twists when Uranus activates this afternoon, threatening to spoil your plans with roadblocks and restrictions. Luckily, you'll have a chance to shake off these funky vibes as evening settles in, though you'll need to actively access your optimism. A stagnant energy takes hold when Venus and Saturn square off later tonight, marking the perfect excuse to hide in bed.",
    "Virgo":"Take a moment to appreciate your most intimate connections this morning, dear Virgo, sending some extra love to those who guard your deepest secrets. This cosmic climate will put you in a highly private mood, causing you to become extra selective of who you socialize with. A celestial shakeup is forecasted when Luna and Uranus square off this afternoon, heightening your need for solitude while bringing through psychic downloads and a-ha moments. Treat yourself to a relaxing salt bath or mediation session when the Nodes of Fate activate this evening, bringing forth a supportive and cleansing energy.",
    "Libra":"A soft and romantic energy manifests early this morning, dear Libra, as the Leo moon blows a kiss to Chiron. While these vibes are great for flirting and nurturing connections, be mindful to love yourself first, extending sweetness to the collective as well. Try not to make any rash decisions when Luna squares off with Uranus this afternoon, taking special care to avoid commitments and conflict. Love flows freely when the Nodes of Fate activate this evening, encouraging you to follow what feels good and lifts the heart. Get to bed at your usual hour before Venus and Saturn face off later tonight, threatening to throw off your routine.",
    "Scorpius":"You'll start to see your hard work paying off, dear Scorpio, thanks to a sweet exchange between the Leo moon and Chiron. Find motivation in these vibes by looking for opportunities to add more to your life, shifting around certain duties or routines to make room for growth. Watch out for unexpected drama within matters of the heart when Luna and Uranus square off this afternoon, taking care to remain composed and in control should tension arise. You'll find joy in implementing new habits when the Nodes of Fate activate this evening, furthering your resolve to switch things up a bit.",
    "Sagittarius":"A spiritual and creative energy creeps in just before dawn, dear Sagittarius, thanks to a sweet exchange between the Leo moon and Chiron. Lean into these vibes by spicing up your morning with some fun, lightening the mood with music, laughter, and a touch of silliness. Unfortunately, a more serious tone takes hold when Luna and Uranus square off this afternoon, threatening to dust up trouble if you don't stay on task. Try to do some socializing when the Nodes of Fate activate this evening, gravitating toward those who inspire and motivate you. Just be sure to head home at a reasonable hour before Venus and Saturn face off late tonight.",
    "Capricorn":"An emotionally charged yet therapeutic energy washes over you this morning, dear Capricorn, as the Leo moon blows a kiss to Chiron. Allow yourself to fully experience and understand your feelings, finding ways to release and breathe out any grief or tension you're ready to part ways with. Watch out for ego bruises when Luna and Uranus square off this afternoon, and try not to take the bait if any friends or loved ones attempt to stir up drama. A restorative energy fills your home when the Nodes of Fate activate this evening, encouraging you to set boundaries and recharge.",
    "Aquarius":"Say nice things to yourself and your loved ones, dear Aquarius, as the Leo moon blows a kiss to Chiron. Love flows freely under this cosmic climate, helping you kick off the day to a sweet and harmonious start. Unfortunately, rockier vibes prevail as afternoon settles in and Luna squares off with Uranus, bringing an unpredictable and moody energy to the table. It could be difficult to control your emotions amidst this heavy ambiance, especially if you're feeling creatively stuck or have fallen behind on your self-care rituals. Plan on laying low as the day comes to a close, looking for ways to release stress.",
    "Pisces":"Connect with your body as the Leo moon aligns with Chiron this morning, dear Pisces, taking the time to appreciate your physical self with a little extra love. Lean into these vibes by appreciating all that your senses have to offer, treasuring small moments of beauty and simple pleasures. Watch out for disorganization and miscommunications when Luna and Uranus square off this afternoon, and avoid speaking impulsively. Opportunities for prosperity could come into play when the Nodes of Fate activate this evening. Be sure to look toward the future, considering the level of comfort you hope to achieve."
}